cf_billing/Documents/бестНазначениеОтветственногоПИР.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>бестНазначениеОтветственногоПИР</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.бестОтветственныйПИР</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ОтветственныйПИР</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСозданияДокумента</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СписокСтроений</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Строение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргСтроения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КлючПомещения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргКлючиПомещений</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Абонент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргАбоненты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

cf_billing/Catalogs/энргСтроения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>энргСтроения</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Архив</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Бойлер</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидБлагоустройства</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргВидыБлагоустройств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОбъектаАбонентов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргВидыОбъектовАбонента</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГодПостройки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Город</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаПотребителейПоУмолчанию</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргГруппыПотребителей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Дом</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Индекс</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>6</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Корпус</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаселенныйПункт</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Регион</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СлужебныеЗаписки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипПлиты</Name>
					<Type>
						<v8:Type>cfg:EnumRef.энргТипыПлит</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Улица</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоЭтажей</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МаршрутКонтроллера</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргМаршрутыКонтроллеров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипСтроения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.энргТипыСтроений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>удалитьФилиал</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргФилиалы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗакрытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УлицаНедобавленнаяВФИАС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргУлицыНедобавленныеВФИАС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьВетхостьСтроения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаТочекПоставки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргГруппыТочекПоставки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОКТМО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>11</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>КонтактнаяИнформация</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Тип</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вид</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначенияПолей</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Страна</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Регион</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Город</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресЭП</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоменноеИмяСервера</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефона</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефонаБезКодов</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидДляСписка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ВидыБлагоустройстваТарифныеКатегории</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Услуга</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргВидыУслуг</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидБлагоустройстваИндивидуальный</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргВидыБлагоустройств</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидБлагоустройстваОбщедомовой</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргВидыБлагоустройств</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТарифнаяКатегория</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргГруппыПотребителей</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

cf_billing/Documents/бестНазначениеОтветственногоПИР/Forms/ФормаДокумента/Ext/Form/Module.bsl
#Область СобытияФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	// ВводНаОсновании
	ВводНаОсновании.ПриСозданииНаСервере(ЭтотОбъект, Элементы.ПодменюСоздатьНаОсновании);
	// Конец ВводНаОсновании

	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПараметрыРазмещения = ПодключаемыеКоманды.ПараметрыРазмещения();
	ПараметрыРазмещения.КоманднаяПанель = Элементы.ПодменюОтчеты;
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект, ПараметрыРазмещения);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
КонецПроцедуры
	
#КонецОбласти


#Область СобытияРеквизитов

&НаКлиенте
Процедура СтроениеПриИзменении(Элемент)
	УстановитьДоступностьПриИзмененииСтроения();
	ОчиститьПоляПриУстановкеСтроения();
КонецПроцедуры


&НаКлиенте
Процедура ТекущийОтветственныйПриИзменении(Элемент)
	ПустойПользователь 	= ПредопределенноеЗначение("Справочник.Пользователи.ПустаяСсылка");
	ОчиститьЗначение 	= ПроверитьИзменениеОтветственного(ПустойПользователь);
	Если ОчиститьЗначение Тогда 
		ТекущийОтветственный = ПустойПользователь;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОтветственныйПИРПриИзменении(Элемент)
	ПустойПользователь 	= ПредопределенноеЗначение("Справочник.Пользователи.ПустаяСсылка");
	ОчиститьЗначение = ПроверитьИзменениеОтветственного(ПустойПользователь);
	Если ОчиститьЗначение Тогда 
		Объект.ОтветственныйПИР = ПустойПользователь;
	КонецЕсли;
КонецПроцедуры 

&НаКлиенте
Функция ПроверитьИзменениеОтветственного(ПустойПользователь)	
	Если НЕ Объект.ОтветственныйПИР = ТекущийОтветственный ИЛИ 
		(Объект.ОтветственныйПИР = ПустойПользователь И ТекущийОтветственный = ПустойПользователь) Тогда
		
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина;
КонецФункции


&НаКлиенте
Процедура УлицаПриИзменении(Элемент)
	УлицаНомерДомаПриИзменении();
КонецПроцедуры

&НаКлиенте
Процедура НомерДомаПриИзменении(Элемент)
	УлицаНомерДомаПриИзменении();
КонецПроцедуры

&НаКлиенте
Процедура УлицаНомерДомаПриИзменении()
	УстановитьДоступностьПриИзмененииУлицы();
	ОчиститьПоляПриУстановкеУлицы();
КонецПроцедуры

#КонецОбласти

#Область РаботаСТаблицейАбонентов

&НаКлиенте
Процедура Заполнить(Команда)		
	Если Объект.СписокСтроений.Количество() = 0 Тогда
		ЗаполнитьНаСервере(Ложь);
		Возврат;
	КонецЕсли;
	
	Режим 		= РежимДиалогаВопрос.ДаНетОтмена;
	Оповещение 	= Новый ОписаниеОповещения("ПослеЗакрытияВопроса", ЭтотОбъект);
	ПоказатьВопрос(Оповещение, "Очистить список?", Режим);
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияВопроса(Результат, ДопПараметры) Экспорт 
	Если Результат = КодВозвратаДиалога.Да Тогда
        ЗаполнитьНаСервере(Истина);
	ИначеЕсли Результат = КодВозвратаДиалога.Нет Тогда 		
		ЗаполнитьНаСервере(Ложь);
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНаСервере(ОчищатьТаблицу)
	Если ОчищатьТаблицу Тогда
		Объект.СписокСтроений.Очистить();
	КонецЕсли;
	Отборы 				= ИнициализироватьОтборы();
	ТаблицаЗаполнения 	= Объект.СписокСтроений;
	Документы.бестНазначениеОтветственногоПИР.ЗаполнитьТаблицуДанными(ТаблицаЗаполнения, Отборы);
КонецПроцедуры

#КонецОбласти


#Область РаботаСоСвойствамиЭлементов

&НаКлиенте
Процедура УстановитьДоступностьПриИзмененииСтроения()
	ЗначениеСвойства = НЕ ЗначениеЗаполнено(Строение);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "Улица"		, "Доступность", ЗначениеСвойства);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "НомерДома"	, "Доступность", ЗначениеСвойства);
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьПоляПриУстановкеСтроения()
	Улица 		= "";
	НомерДома 	= 0;
КонецПроцедуры


&НаКлиенте
Процедура УстановитьДоступностьПриИзмененииУлицы()
	ЗначениеСвойства = НЕ (ЗначениеЗаполнено(Улица) ИЛИ ЗначениеЗаполнено(НомерДома));
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "Строение", "Доступность", ЗначениеСвойства);
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьПоляПриУстановкеУлицы()
	Строение = ПредопределенноеЗначение("Справочник.энргСтроения.ПустаяСсылка");
КонецПроцедуры

#КонецОбласти

#Область РаботаСОтборами

&НаСервере
Функция ИнициализироватьОтборы()
	Результат 							= Документы.бестНазначениеОтветственногоПИР.ПолучитьСтруктуруОтборов();
	Результат.Период					= Новый Граница(Объект.Дата, ВидГраницы.Исключая);
	Результат.Организация 				= Объект.Организация;	
	Результат.Район 					= Объект.Район;
	Результат.ОтветственныйКУстановке 	= Объект.ОтветственныйПИР;	
	
	ИнициализироватьНеобязательныеОтборы(Результат);		
	Возврат Результат;
КонецФункции

&НаСервере
Процедура ИнициализироватьНеобязательныеОтборы(Результат)
	НеобязательныеОтборы = Новый Структура;
	
	Если ЗначениеЗаполнено(Строение) Тогда
		НеобязательныеОтборы.Вставить("Строение", Строение);
	КонецЕсли;
	Если ЗначениеЗаполнено(ТекущийОтветственный) Тогда
		НеобязательныеОтборы.Вставить("ТекущийОтветственный", ТекущийОтветственный);
	КонецЕсли;
	Если ЗначениеЗаполнено(Улица) Тогда
		НеобязательныеОтборы.Вставить("Улица", Улица);
	КонецЕсли;
	Если НомерДома > 0 Тогда
		НеобязательныеОтборы.Вставить("НомерДома", НомерДома);
	КонецЕсли;
	Если НомерКвДо > 0 Тогда
		НеобязательныеОтборы.Вставить("НомерКвДо", НомерКвДо);
	КонецЕсли;
	Если НомерКвОт > 0 Тогда
		НеобязательныеОтборы.Вставить("НомерКвОт", НомерКвОт);
	КонецЕсли;	
	
	Если НЕ НеобязательныеОтборы.Количество() = 0 Тогда 
		Результат.НеобязательныеОтборы = НеобязательныеОтборы;	
	КонецЕсли;
КонецПроцедуры
	
#КонецОбласти

#Область ОбработчикиКомандФормы

// ВводНаОсновании
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуСоздатьНаОсновании(Команда)
	
	ВводНаОснованииКлиент.ВыполнитьПодключаемуюКомандуСоздатьНаОсновании(Команда, ЭтотОбъект, Объект);
	
КонецПроцедуры
// Конец ВводНаОсновании

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	МодульПодключаемыеКомандыКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("ПодключаемыеКомандыКлиент");
	МодульПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат)
	МодульПодключаемыеКоманды = ОбщегоНазначения.ОбщийМодуль("ПодключаемыеКоманды");
	МодульПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	МодульПодключаемыеКомандыКлиентСервер = ОбщегоНазначенияКлиент.ОбщийМодуль("ПодключаемыеКомандыКлиентСервер");
	МодульПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти
